structure/soap/command.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd"><s:Header><a:To>https://outlook.office365.com:443/powershell-liveid?PSVersion=4.0</a:To><a:ReplyTo><a:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address></a:ReplyTo><a:Action s:mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/Command</a:Action><w:MaxEnvelopeSize s:mustUnderstand="true">512000</w:MaxEnvelopeSize><a:MessageID></a:MessageID><w:Locale xml:lang="en-US" s:mustUnderstand="false" /><p:DataLocale xml:lang="ru-RU" s:mustUnderstand="false" /><p:SessionId s:mustUnderstand="false"></p:SessionId><p:OperationID s:mustUnderstand="false"></p:OperationID><p:SequenceId s:mustUnderstand="false">1</p:SequenceId><w:ResourceURI xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd">http://schemas.microsoft.com/powershell/Microsoft.Exchange</w:ResourceURI><w:SelectorSet xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"><w:Selector Name="ShellId"></w:Selector></w:SelectorSet><w:OperationTimeout>PT180.000S</w:OperationTimeout></s:Header><s:Body><rsp:CommandLine xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" CommandId=""><rsp:Command></rsp:Command><rsp:Arguments></rsp:Arguments></rsp:CommandLine></s:Body></s:Envelope>